app/helpers/welcome_helper.rb

    def available_months
        Freq.select('anomes').distinct.map { |e| e.anomes }
---
SELECT DISTINCT "freqs"."anomes" FROM "freqs"